{
    "contracts": [{"contractType":"cmc","cost":110,"expiryDate":"2024-08-12","id":"4b0098fb-2","serialNo":"47298b3f-6f95-4","startDate":"2025-05-01","status":"Suspended","terms":"Sit, et parabilis et terminatas habet; inanium autem cupiditatum nec modus est neque honoris neque imperii nec libidinum nec epularum nec reliquarum cupiditatum, quas nulla praeda umquam improbe parta minuit.","vendor":"Pacific Biosciences of California, Inc."},
{"contractType":"amc","cost":346,"expiryDate":"2025-06-11","id":"a3903342-2","serialNo":"d7d2b7c9-da8e-4","startDate":"2024-11-23","status":"Renewed","terms":"Doloribus eosque humili animo inbecilloque ferre miserum est, ob eamque debilitatem animi multi parentes, multi amicos, non nulli patriam, plerique autem se ipsos diligant.","vendor":"iRadimed Corporation"},
{"contractType":"amc","cost":729,"expiryDate":"2024-12-05","id":"3bab9ad4-b","serialNo":"b552d3f6-d3bd-4","startDate":"2025-02-11","status":"Cancelled","terms":"Cum id, quod his libris quaeritur, qui sit finis, quid extremum, quid ultimum, quo sint omnia bene vivendi recteque faciendi consilia referenda, quid sequatur natura ut summum ex rebus expetendis, quid fugiat ut extremum malorum? Qua de re cum sit inter doctissimos summa dissensio.","vendor":"Royal Caribbean Cruises Ltd."},
{"contractType":"cmc","cost":416,"expiryDate":"2025-06-28","id":"6d9c295e-7","serialNo":"eb5f40f6-d9d4-4","startDate":"2024-08-25","status":"Active","terms":"-- Quid ex eo est consecutus? -- Laudem et caritatem, quae sunt vitae sine metu vivere. Quae est enim in vita tantopere quaerendum quam cum omnia in philosophia, tum id, quod sentiant non esse faciendum, ii voluptatem maximam adipiscuntur praetermittenda voluptate. Idem etiam dolorem saepe perpetiuntur, ne, si.","vendor":"Vistra Energy Corp."},
{"contractType":"cmc","cost":381,"expiryDate":"2024-09-29","id":"6e04075d-c","serialNo":"232ca800-9ff5-4","startDate":"2024-11-12","status":"Under Review","terms":"Intelleges eitam, ut ab ea nullo modo probantur, tamen Democritum laudatum a ceteris ab hoc, qui eum unum secutus esset, nollem vituperatum. Iam in altera philosophiae parte. Quae est quaerendi ac disserendi, quae logikh dicitur, iste.","vendor":"OFG Bancorp"},
{"contractType":"amc","cost":934,"expiryDate":"2024-08-13","id":"ec672a53-7","serialNo":"6aca5e74-3b4f-4","startDate":"2024-08-24","status":"Expired","terms":"Attento intuemur, tum fit ut aegritudo sequatur, si illa mala sint, laetitia, si bona. O praeclaram.","vendor":"FlexShares STOXX US ESG Impact Index Fund"},
{"contractType":"cmc","cost":880,"expiryDate":"2025-05-16","id":"667c5031-2","serialNo":"e078c55a-925e-4","startDate":"2025-06-24","status":"Terminated","terms":"Numeranda nec in malis dolor, non existimant oportere nimium nos causae confidere, sed et argumentandum et accurate disserendum et rationibus conquisitis de voluptate et.","vendor":"Glaukos Corporation"},
{"contractType":"amc","cost":398,"expiryDate":"2025-06-28","id":"417eeb73-f","serialNo":"14ed5d28-307e-4","startDate":"2025-01-17","status":"Draft","terms":"Igitur, inquit: unam rem explicabo, eamque maximam, de physicis alias, et quidem locis pluribus. Sed quot homines, tot sententiae; falli igitur possumus. Quam ob rem dissentientium inter se cohaerescant, ex quo efficeretur mundus omnesque partes mundi, quaeque in eo ipso parum vidit, deinde hoc quoque.","vendor":"SVB Financial Group"},
{"contractType":"cmc","cost":308,"expiryDate":"2025-02-16","id":"896ec7d0-7","serialNo":"aa9c3a16-8074-4","startDate":"2025-02-25","status":"Completed","terms":"Conetur, nec optinere, si effecerit, et.","vendor":"Acceleron Pharma Inc."},
{"contractType":"amc","cost":106,"expiryDate":"2024-09-04","id":"ad89b703-b","serialNo":"8e2449c1-645a-4","startDate":"2024-11-09","status":"Pending","terms":"Ut aliquam ex eo perciperet.","vendor":"Southern California Edison Company"},
{"contractType":"cmc","cost":601,"expiryDate":"2025-01-04","id":"6e67857d-b","serialNo":"8f5be296-11d1-4","startDate":"2025-05-27","status":"Pending","terms":"Divina illa ingenia transferrem. Sed id neque feci adhuc nec mihi tamen, ne faciam, interdictum puto. Locos quidem quosdam, si videbitur, transferam, et maxime ab iis, quos ego.","vendor":"Community Healthcare Trust Incorporated"},
{"contractType":"amc","cost":682,"expiryDate":"2025-04-27","id":"a2ae909b-4","serialNo":"093072ad-959c-4","startDate":"2024-09-30","status":"Draft","terms":"Natura aut sollicitare possit aut angere. Praeterea et appetendi et refugiendi et omnino rerum gerendarum initia proficiscuntur aut a dolore. Quod cum ita esset affecta, secundum non recte.","vendor":"Vanguard Russell 1000 Growth ETF"},
{"contractType":"amc","cost":750,"expiryDate":"2024-07-08","id":"4c06cf88-9","serialNo":"bb55d88b-c245-4","startDate":"2025-06-01","status":"Completed","terms":"Verentur ne, si amicitiam propter nostram voluptatem expetendam putemus, tota amicitia quasi claudicare videatur. Itaque primos congressus copulationesque.","vendor":"IRSA Propiedades Comerciales S.A."},
{"contractType":"cmc","cost":250,"expiryDate":"2025-02-15","id":"43fdc5a2-3","serialNo":"fbb0fa28-6774-4","startDate":"2024-11-27","status":"Expired","terms":"Expedita distinctio. Nam libero tempore, cum soluta nobis est.","vendor":"Fiserv, Inc."},
{"contractType":"cmc","cost":756,"expiryDate":"2025-01-31","id":"f4c899ad-0","serialNo":"1d0d57e8-7f6e-4","startDate":"2025-05-08","status":"Renewed","terms":"Efficiantur ea, quae corrigere vult, mihi quidem videtur, inermis ac nudus est. Tollit definitiones, nihil.","vendor":"Anavex Life Sciences Corp."},
{"contractType":"amc","cost":288,"expiryDate":"2025-01-21","id":"5a5a17e0-3","serialNo":"f956eb22-5bf1-4","startDate":"2024-11-18","status":"Terminated","terms":"Sophocles vel optime scripserit Electram, tamen male conversam Atilii mihi legendam putem, de quo quaerimus, non quo ignorare vos arbitrer, sed ut ratione et via procedat oratio. Quaerimus.","vendor":"Alpine Global Dynamic Dividend Fund"},
{"contractType":"cmc","cost":561,"expiryDate":"2024-07-14","id":"dee874df-2","serialNo":"c6ed0915-9b9b-4","startDate":"2025-05-28","status":"Cancelled","terms":"Tandem hoc statu praestabiliorem aut magis expetendum possimus dicere? Inesse enim necesse est effici, ut sapiens solum amputata circumcisaque inanitate omni et errore naturae finibus contentus sine aegritudine possit et.","vendor":"Kayne Anderson MLP Investment Company"},
{"contractType":"amc","cost":734,"expiryDate":"2025-06-26","id":"800b0d48-c","serialNo":"6a920599-23d7-4","startDate":"2025-02-01","status":"Suspended","terms":"Adipisci velit, sed quia pacem animis afferat et eos quasi concordia quadam placet ac leniat. Temperantia est enim, quae in rebus aut expetendis aut fugiendis ut rationem sequamur monet. Nec enim habet.","vendor":"Williams Companies, Inc. (The)"},
{"contractType":"cmc","cost":109,"expiryDate":"2024-08-17","id":"639797aa-5","serialNo":"dbcf7659-38ea-4","startDate":"2025-01-13","status":"Under Review","terms":"Contra gaudere nosmet omittendis doloribus, etiamsi voluptas ea, quae senserit ille, tibi non vera videantur. Vide, quantum, inquam, fallare, Torquate. Oratio me istius philosophi non offendit; nam et complectitur verbis, quod vult, et dicit plane, quod intellegam; et tamen ego.","vendor":"Altria Group"},
{"contractType":"amc","cost":365,"expiryDate":"2025-07-02","id":"b652fc15-7","serialNo":"7c48d193-eda0-4","startDate":"2024-10-29","status":"Active","terms":"De homine sensibus reliqui nihil est, necesse est, non expeteretur, si nihil tale metuamus. Iam illud quidem adduci vix possum, ut ea, quae hoc non minus declarant, sed videntur leviora, veniamus. Quid tibi, Torquate, quid huic.","vendor":"PowerShares S&P SmallCap Health Care Portfolio"},
{"contractType":"cmc","cost":102,"expiryDate":"2025-06-12","id":"b68cf0e4-6","serialNo":"9d1e3375-3c3a-4","startDate":"2024-07-18","status":"Terminated","terms":"Amicitiae praesidium esse firmissimum.' Sunt autem quidam e nostris, et scribentur fortasse plura, si vita suppetet; et tamen, qui diligenter haec, quae de philosophia litteris mandamus, legere assueverit, iudicabit nulla ad legendum his esse potiora. Quid est cur tam multos legant, quam legendi sunt. Quid enim me prohiberet.","vendor":"PowerShares S&P SmallCap Consumer Discretionary Portfolio"},
{"contractType":"amc","cost":432,"expiryDate":"2025-03-28","id":"94140dcd-1","serialNo":"a20d7736-06d2-4","startDate":"2024-10-14","status":"Active","terms":"Sit inter doctissimos summa dissensio, quis alienum putet eius esse dignitatis, quam mihi quisque tribuat, quid in omni.","vendor":"Global X SuperDividend REIT ETF"},
{"contractType":"amc","cost":556,"expiryDate":"2025-06-29","id":"d1bab091-3","serialNo":"1d2773a8-6a35-4","startDate":"2024-10-23","status":"Pending","terms":"Timidiores paulo contra vestra convicia, sed tamen satis acuti, qui verentur ne, si id non faciant, incidant in maiorem. Ex quo efficiantur ea, quae dixi, sole ipso illustriora.","vendor":"Summit State Bank"},
{"contractType":"cmc","cost":154,"expiryDate":"2024-08-28","id":"d81dfa8b-9","serialNo":"025610ae-d89e-4","startDate":"2025-05-31","status":"Suspended","terms":"Vel maxime, quod ipsa natura, ut ait ille, sciscat et probet, id est corpora individua propter soliditatem, censet in infinito inani.","vendor":"Level 3 Communications, Inc."},
{"contractType":"cmc","cost":294,"expiryDate":"2025-05-06","id":"f5e0f9ed-1","serialNo":"e7e4edca-3fdb-4","startDate":"2024-10-05","status":"Expired","terms":"Exiguam dixit fortunam intervenire sapienti maximasque ab eo ortum, tam inportuno tamque crudeli; sin, ut dolore suo sanciret militaris imperii disciplinam exercitumque.","vendor":"Del Taco Restaurants, Inc."},
{"contractType":"amc","cost":431,"expiryDate":"2024-09-25","id":"4cc53483-4","serialNo":"3e5725ad-e44b-4","startDate":"2024-08-31","status":"Cancelled","terms":"Leviora, veniamus. Quid tibi, Torquate, quid huic Triario litterae, quid historiae cognitioque rerum, quid poetarum evolutio, quid tanta tot versuum memoria voluptatis affert? Nec mihi tamen, ne faciam, interdictum puto. Locos quidem quosdam, si videbitur, transferam, et maxime ab iis, quos modo.","vendor":"iStar Financial Inc."},
{"contractType":"cmc","cost":689,"expiryDate":"2024-08-19","id":"4384edba-2","serialNo":"33caee7e-ee7e-4","startDate":"2024-09-16","status":"Draft","terms":"Igitur Epicuri non probo, inquam. De cetero vellem equidem aut ipse doctrinis fuisset instructior -- est enim, quod tibi ita videri necesse est, non satis politus iis artibus, quas qui tenent, eruditi.","vendor":"CHS Inc"},
{"contractType":"amc","cost":587,"expiryDate":"2025-04-11","id":"cbdda058-e","serialNo":"07b36842-7710-4","startDate":"2024-12-27","status":"Completed","terms":"Et ad corpus nihil referatur, ista.","vendor":"CyrusOne Inc"},
{"contractType":"cmc","cost":729,"expiryDate":"2025-02-27","id":"29f069dc-e","serialNo":"bc053df8-a535-4","startDate":"2025-03-28","status":"Under Review","terms":"Est intercapedo molestiae. Igitur neque stultorum quisquam.","vendor":"Casella Waste Systems, Inc."},
{"contractType":"amc","cost":839,"expiryDate":"2025-03-15","id":"238481fa-b","serialNo":"fec7163a-1d8b-4","startDate":"2025-01-18","status":"Renewed","terms":"Perpetua oblivione obruamus et secunda iucunde ac suaviter meminerimus. Sed cum ea, quae senserit ille, tibi non vera videantur. Vide, quantum, inquam, fallare, Torquate. Oratio me istius philosophi non offendit; nam et complectitur verbis, quod vult, et dicit plane, quod intellegam; et tamen ego a philosopho, si afferat.","vendor":"Micron Technology, Inc."},
{"contractType":"cmc","cost":211,"expiryDate":"2024-10-08","id":"38022b2b-3","serialNo":"26764067-f551-4","startDate":"2025-04-27","status":"Cancelled","terms":"Vitae molestias accessio potest fieri, quanta ad augendas, cum conscientia factorum, tum poena legum odioque civium? Et tamen in quibusdam neque pecuniae modus est neque honoris neque imperii nec libidinum nec epularum nec reliquarum cupiditatum, quas nulla praeda umquam improbe parta minuit, sed potius inflammat, ut coercendi magis quam dedocendi esse videantur. Invitat igitur vera.","vendor":"Intercept Pharmaceuticals, Inc."},
{"contractType":"amc","cost":865,"expiryDate":"2025-04-01","id":"30f759dc-7","serialNo":"d7a50207-ca45-4","startDate":"2025-06-22","status":"Active","terms":"Maiora enim quaedam nos natura genuit et conformavit, ut mihi quidem depravare videatur. Ille atomos quas appellat, id est in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa, qui officia deserunt mollitia animi, id est vel summum bonorum vel ultimum vel extremum.","vendor":"Zions Bancorporation"},
{"contractType":"amc","cost":222,"expiryDate":"2025-06-20","id":"13e32c5e-6","serialNo":"3d344614-9c0b-4","startDate":"2024-10-24","status":"Renewed","terms":"-- Ita credo. -- 'Non est igitur voluptas bonum.' Hoc ne statuam quidem dicturam pater aiebat, si loqui posset. Conclusum est enim contra Cyrenaicos satis acute, nihil ad Epicurum. Nam si dicent ab illis has res.","vendor":"Nuveen Preferred Income Opportunites Fund"},
{"contractType":"cmc","cost":451,"expiryDate":"2024-10-12","id":"c80a6260-4","serialNo":"cd814361-bb1f-4","startDate":"2024-07-31","status":"Draft","terms":"Esse potest nec in malis dolor, non existimant oportere nimium nos causae confidere, sed et argumentandum et accurate disserendum et rationibus conquisitis de voluptate et dolore magnam.","vendor":"Apricus Biosciences, Inc."},
{"contractType":"amc","cost":625,"expiryDate":"2024-08-11","id":"c3a4bdae-5","serialNo":"5ac604a4-e839-4","startDate":"2025-02-06","status":"Expired","terms":"Desiderat?' -- Nihil sane. -- 'At, si voluptas esset bonum, fuisse desideraturam. Idcirco enim non desideraret, quia, quod dolore caret, id in hominum consuetudine facilius fieri poterit et iustius? Sunt autem, qui.","vendor":"Ottawa Bancorp, Inc."},
{"contractType":"cmc","cost":206,"expiryDate":"2025-01-18","id":"499ba54b-b","serialNo":"8e8e29bf-2c49-4","startDate":"2025-04-04","status":"Terminated","terms":"Eligendi optio, cumque nihil impedit, quo minus omnes mea legant. Utinam esset ille Persius, Scipio vero et Rutilius multo etiam magis, quorum ille iudicium reformidans Tarentinis ait se et Consentinis et Siculis scribere. Facete is quidem, sicut alia; sed neque.","vendor":"Preferred Apartment Communities, Inc."},
{"contractType":"cmc","cost":880,"expiryDate":"2024-12-23","id":"3dbc09a8-4","serialNo":"1e7fd50c-49fb-4","startDate":"2024-09-07","status":"Suspended","terms":"Maxime hominum vita vexetur, ob eumque errorem et voluptatibus maximis saepe priventur et durissimis animi doloribus torqueantur, sapientia est adhibenda, quae et a formidinum terrore vindicet et ipsius fortunae modice ferre doceat iniurias et omnis monstret.","vendor":"CPB Inc."},
{"contractType":"amc","cost":987,"expiryDate":"2024-11-30","id":"4fa2b1f4-6","serialNo":"4a5268c9-5015-4","startDate":"2025-03-18","status":"Completed","terms":"Muniti videntur, deorum tamen horrent easque ipsas sollicitudines, quibus eorum animi noctesque diesque exeduntur, a diis inmortalibus supplicii causa importari putant. Quae autem de bene beateque vivendum. Sed existimo te, sicut nostrum Triarium, minus ab eo.","vendor":"Poage Bankshares, Inc."},
{"contractType":"cmc","cost":174,"expiryDate":"2025-06-29","id":"7fae6953-e","serialNo":"7ab3256f-0994-4","startDate":"2025-04-21","status":"Under Review","terms":"Etiam sapientia est; sive hoc difficile est, tamen nec modus ullus nec finis inveniri potest. Quodsi corporis gravioribus morbis vitae iucunditas impeditur, quanto magis animi morbis impediri necesse est! Animi autem morbi.","vendor":"Argan, Inc."},
{"contractType":"amc","cost":870,"expiryDate":"2024-12-05","id":"3f9bd10a-4","serialNo":"aa800a66-9c4a-4","startDate":"2025-02-01","status":"Pending","terms":"Malorum memoria torquentur, sapientes bona praeterita non meminerunt, praesentibus non fruuntur, futura modo expectant, quae quia certa esse non possunt, victi et debilitati obiecta specie voluptatis tradunt se.","vendor":"Chegg, Inc."},
{"contractType":"cmc","cost":976,"expiryDate":"2025-05-04","id":"106c438b-d","serialNo":"6f10f00e-f57f-4","startDate":"2025-02-06","status":"Pending","terms":"Sic: Omne animal, simul atque natum sit, voluptatem appetere eaque gaudere ut summo bono, dolorem aspernari ut summum ex rebus expetendis, quid fugiat ut extremum malorum? Qua de re cum.","vendor":"PartnerRe Ltd."},
{"contractType":"amc","cost":601,"expiryDate":"2024-08-19","id":"722914b0-f","serialNo":"5f1ca1ea-96d5-4","startDate":"2024-11-29","status":"Cancelled","terms":"Eas ergo artes persequeretur, vivendi artem tantam tamque et operosam et perinde fructuosam relinqueret? Non ergo Epicurus ineruditus, sed ii indocti, qui, quae pueros non didicisse turpe est, ea putant usque ad senectutem esse discenda. Quae cum dixisset, Explicavi, inquit, sententiam meam, et eo quidem consilio, tuum iudicium ut cognoscerem, quoniam mihi ea facultas, ut.","vendor":"Wells Fargo & Company"},
{"contractType":"amc","cost":312,"expiryDate":"2024-12-24","id":"335ec7d6-e","serialNo":"e2ea847b-769d-4","startDate":"2025-04-02","status":"Completed","terms":"Tuentur tamen eum locum seque facile, ut mihi quidem nulli satis eruditi videntur, quibus nostra ignota sunt. An 'Utinam ne in nemore . . .' nihilo minus legimus quam hoc idem Graecum, quae autem tanta ex improbis factis ad minuendas vitae molestias accessio potest fieri, quanta ad augendas.","vendor":"Navios Maritime Holdings Inc."},
{"contractType":"cmc","cost":306,"expiryDate":"2024-09-15","id":"adb59930-a","serialNo":"61af2632-e17a-4","startDate":"2025-05-18","status":"Active","terms":"Simul atque natum sit, voluptatem appetere eaque gaudere ut summo bono, dolorem aspernari ut summum malum et, quantum possit, a se repellere, idque facere nondum depravatum ipsa natura incorrupte atque integre iudicante. Itaque negat opus esse ratione neque disputatione, quam.","vendor":"Roadrunner Transportation Systems, Inc"},
{"contractType":"cmc","cost":221,"expiryDate":"2024-08-13","id":"511778b1-e","serialNo":"e7251ca8-8154-4","startDate":"2024-10-09","status":"Renewed","terms":"Non proident, sunt in eadem causa sunt, qua ante quam nati, et ad dolores ita paratus est, ut meminerit maximos morte finiri, parvos multa habere intervalla requietis, mediocrium nos esse dominos, ut, si tolerabiles sint, feramus, si minus, animo aequo e vita, cum ea non placeat, tamquam e theatro exeamus. Quibus rebus.","vendor":"Merit Medical Systems, Inc."},
{"contractType":"amc","cost":621,"expiryDate":"2025-05-09","id":"9c7e0747-d","serialNo":"5104845a-2003-4","startDate":"2025-04-16","status":"Terminated","terms":"Obcaecati cupiditate non provident, similique sunt in eadem causa sunt, qua ante quam nati, et ad usus civium non inutile, nosque ea scripta reliquaque.","vendor":"China Xiniya Fashion Limited"},
{"contractType":"cmc","cost":252,"expiryDate":"2024-11-28","id":"9c5d2b8e-0","serialNo":"98c5f3ec-8c9c-4","startDate":"2024-07-21","status":"Draft","terms":"Rerum defuturum, quas natura non depravata desiderat. Et quem ad me in Cumanum salutandi causa uterque venisset, pauca primo inter nos de litteris, quarum summum erat in utroque studium, deinde Torquatus: Quoniam nacti te, inquit, sumus aliquando otiosum, certe audiam, quid sit, quod Epicurum nostrum non tu quidem.","vendor":"Weatherford International plc"},
{"contractType":"amc","cost":908,"expiryDate":"2025-02-23","id":"9f5fd6c1-d","serialNo":"bcc6b57f-1aed-4","startDate":"2024-07-15","status":"Suspended","terms":"Bene vivendi recteque faciendi consilia referenda, quid sequatur natura ut summum ex rebus expetendis, quid fugiat ut extremum malorum? Qua de re cum sit inter doctissimos summa dissensio, quis alienum putet eius esse dignitatis, quam mihi quisque tribuat, quid in omni re doloris amotio successionem efficit voluptatis. Itaque non placuit Epicuro medium esse quiddam inter dolorem et voluptatem; illud enim ipsum, quod quibusdam medium videretur, cum omni dolore et molestia.","vendor":"Liberty Global plc"},
{"contractType":"cmc","cost":964,"expiryDate":"2024-12-01","id":"3c869e16-1","serialNo":"497638d9-eccb-4","startDate":"2025-02-13","status":"Under Review","terms":"Dictas quis non legat? Nisi qui se Latina scripta dicunt contemnere. In quibus tam multis tamque variis ab ultima antiquitate repetitis tria vix amicorum.","vendor":"Celsion Corporation"},
{"contractType":"amc","cost":794,"expiryDate":"2024-11-20","id":"78adb7a6-a","serialNo":"51552b35-ade3-4","startDate":"2024-12-18","status":"Expired","terms":"Melius sit, accedere? Statue contra aliquem.","vendor":"Leaf Group Ltd."},
{"contractType":"amc","cost":664,"expiryDate":"2025-04-26","id":"d3dd0f32-7","serialNo":"9968c033-d8e3-4","startDate":"2024-09-13","status":"Suspended","terms":"Dulce mel. Quorum nihil oportere exquisitis rationibus confirmare, tantum satis esse admonere. Interesse enim inter argumentum conclusionemque rationis et inter mediocrem animadversionem atque admonitionem. Altera occulta quaedam et horrida, de.","vendor":"Tiptree Inc."},
{"contractType":"cmc","cost":475,"expiryDate":"2025-04-22","id":"667e991a-2","serialNo":"0677c5c4-af0d-4","startDate":"2025-07-01","status":"Completed","terms":"-- 'Non est igitur voluptas bonum.' Hoc ne statuam quidem dicturam pater aiebat, si loqui posset. Conclusum est enim aut utilior aut ad beatam aut ad miseram vitam.","vendor":"EchoStar Corporation"},
{"contractType":"cmc","cost":363,"expiryDate":"2024-08-17","id":"53141a32-4","serialNo":"1cc7559a-8a08-4","startDate":"2024-12-29","status":"Renewed","terms":"Aut malivoli, invidi, difficiles, lucifugi, maledici, monstruosi, alii autem etiam amaret, cotidieque inter nos de litteris, quarum summum erat in.","vendor":"Zions Bancorporation"},
{"contractType":"amc","cost":280,"expiryDate":"2024-10-08","id":"26081e51-4","serialNo":"345b4fb8-005c-4","startDate":"2025-05-20","status":"Cancelled","terms":"Semper impendet, tum superstitio, qua qui affecti sunt in culpa, qui officia deserunt mollitia animi, id est maximisque erroribus animos hominum liberavisse et omnia tradidisse, quae pertinerent ad bene beateque vivendo a Platone disputata sunt, haec explicari non placebit Latine? Quid? Si nos non.","vendor":"MSA Safety Incorporporated"},
{"contractType":"cmc","cost":327,"expiryDate":"2025-05-14","id":"b53935f1-6","serialNo":"ca263235-8c3c-4","startDate":"2025-02-18","status":"Under Review","terms":"Sint ea quamque iucunda, neque pendet ex futuris, sed expectat illa, fruitur praesentibus ab iisque vitiis, quae paulo ante collegi, abest plurimum et, cum stultorum.","vendor":"China XD Plastics Company Limited"},
{"contractType":"amc","cost":203,"expiryDate":"2025-06-09","id":"3c5e36b4-b","serialNo":"62cca5ad-f2a5-4","startDate":"2024-07-18","status":"Terminated","terms":"Est. Nihil enim desiderabile concupiscunt, plusque in ipsa iniuria detrimenti est quam in iis corrigere voluit, deteriora fecit. Disserendi artem nullam habuit.","vendor":"Group 1 Automotive, Inc."},
{"contractType":"amc","cost":556,"expiryDate":"2025-02-13","id":"48195e5e-f","serialNo":"d42eda14-3b27-4","startDate":"2024-07-17","status":"Active","terms":"Quem quidem locum comit multa venustate et omni sale idem.","vendor":"Virtusa Corporation"},
{"contractType":"cmc","cost":699,"expiryDate":"2024-12-12","id":"7d28190c-7","serialNo":"a0ff6e98-bdaa-4","startDate":"2024-12-08","status":"Expired","terms":"Potitur, ut animadvertat quanta sint ea quamque iucunda, neque pendet ex futuris, sed expectat illa.","vendor":"Dean Foods Company"},
{"contractType":"cmc","cost":508,"expiryDate":"2025-03-22","id":"1dcf0b4a-4","serialNo":"f3c0fe21-f5fc-4","startDate":"2024-12-19","status":"Pending","terms":"Non possim accommodare Torquatos nostros? Quos tu paulo ante cum memoriter, tum etiam erga nos amice et benivole collegisti, nec me tamen laudandis maioribus meis corrupisti nec segniorem ad respondendum reddidisti. Quorum facta quem ad modum eae semper voluptatibus inhaererent, eadem de amicitia disputatum. Alii cum eas voluptates, quae ad quietem et ad dolores ita.","vendor":"Standex International Corporation"},
{"contractType":"amc","cost":621,"expiryDate":"2024-08-14","id":"7226a69c-8","serialNo":"6bb47b43-772c-4","startDate":"2024-09-18","status":"Draft","terms":"Quanto id in hominum consuetudine facilius fieri poterit et iustius? Sunt autem, qui dicant foedus esse quoddam sapientium, ut ne minus amicos quam se ipsos amentur. Etenim si delectamur, cum scribimus, quis est tam invidus, qui ab eo delectari, quod ista Platonis, Aristoteli, Theophrasti orationis.","vendor":"Barings Corporate Investors"},
{"contractType":"cmc","cost":891,"expiryDate":"2024-12-18","id":"d9f4a8a2-9","serialNo":"45aac93e-c6d8-4","startDate":"2024-11-13","status":"Pending","terms":"Quae beatae vitae deduceret? Qui quod tibi parum videtur eruditus, ea causa est, quod nullam eruditionem esse duxit, nisi quae beatae vitae deduceret? Qui quod.","vendor":"Cott Corporation"},
{"contractType":"amc","cost":988,"expiryDate":"2024-07-18","id":"cb59baec-0","serialNo":"5579f9cb-5d64-4","startDate":"2024-10-20","status":"Suspended","terms":"Scientiam non ipsius artis, sed bonae valetudinis causa probamus, et gubernatoris ars, quia bene navigandi rationem habet, utilitate, non arte laudatur, sic.","vendor":"First Trust Multi Cap Growth AlphaDEX Fund"},
{"contractType":"amc","cost":562,"expiryDate":"2024-10-25","id":"0daa87d8-2","serialNo":"411ed013-0aca-4","startDate":"2024-10-21","status":"Expired","terms":"Pecuniae studuisse aut imperiis aut opibus aut gloriae. Nullas enim consequuntur voluptates, quarum potiendi spe inflammati multos labores.","vendor":"Vantiv, Inc."},
{"contractType":"cmc","cost":843,"expiryDate":"2024-08-02","id":"011e4ded-9","serialNo":"df915be9-6f05-4","startDate":"2024-12-26","status":"Cancelled","terms":"Torquatos nostros? Quos tu paulo ante collegi, abest plurimum et, cum stultorum vitam cum sua comparat, magna afficitur voluptate. Dolores autem si qui e nostris aliter existimant, quos quidem video esse multos, sed imperitos .","vendor":"Rockwell Automation, Inc."},
{"contractType":"amc","cost":711,"expiryDate":"2024-08-28","id":"2e4c52e0-8","serialNo":"c1eae81e-8ab9-4","startDate":"2025-06-13","status":"Draft","terms":"Chrysippo praetermissum in Stoicis? Legimus tamen Diogenem, Antipatrum, Mnesarchum, Panaetium, multos alios in primisque familiarem nostrum.","vendor":"Healthcare Trust of America, Inc."},
{"contractType":"cmc","cost":806,"expiryDate":"2025-04-23","id":"47cd5d77-b","serialNo":"1df5afe8-a74f-4","startDate":"2025-01-01","status":"Completed","terms":"Dicit, omnium rerum, quas ad beate vivendum se ipsa allicit nec patientia nec.","vendor":"Celadon Group, Inc."},
{"contractType":"cmc","cost":781,"expiryDate":"2024-11-25","id":"56fd52bd-6","serialNo":"ede026f5-5834-4","startDate":"2024-10-07","status":"Under Review","terms":"Est. Tollit definitiones, nihil de dividendo ac partiendo docet, non quo modo efficiatur concludaturque ratio tradit, non qua via captiosa solvantur ambigua distinguantur ostendit; iudicia rerum in sensibus ponit, quibus si semel aliquid falsi pro vero probatum sit, sublatum esse omne iudicium veri et falsi putat. Confirmat autem illud vel maxime, quod ipsa natura incorrupte atque.","vendor":"Radius Health, Inc."},
{"contractType":"amc","cost":908,"expiryDate":"2025-02-18","id":"67930a83-5","serialNo":"5d3a2487-e183-4","startDate":"2025-06-30","status":"Renewed","terms":"Teneam sententiam, quid est cur tam multi sint Epicurei, sunt aliae quoque causae, sed multitudinem haec maxime allicit, quod ita putant dici ab illo, recta et honesta quae sint, ea.","vendor":"Central European Media Enterprises Ltd."},
{"contractType":"cmc","cost":817,"expiryDate":"2025-01-28","id":"fbd6d3c5-f","serialNo":"e4381920-a4f6-4","startDate":"2024-08-30","status":"Terminated","terms":"Possunt haec quadam ratione dici non necesse est. Tribus igitur.","vendor":"Sky Solar Holdings, Ltd."},
{"contractType":"amc","cost":746,"expiryDate":"2024-08-08","id":"1b33b3e1-c","serialNo":"3eeaa9e3-872e-4","startDate":"2024-08-18","status":"Active","terms":"Sapientia comparaverit, nihil esse maius amicitia, nihil uberius, nihil iucundius. Nec vero hoc oratione solum, sed multo etiam magis, quod, cuius in mente consedit, hoc ipso, quod adest.","vendor":"J. Jill, Inc."},
{"contractType":"cmc","cost":795,"expiryDate":"2025-04-18","id":"e34d585c-b","serialNo":"fe57da99-02df-4","startDate":"2024-08-18","status":"Suspended","terms":"Cura metuque vivamus animumque et corpus, quantum efficere possimus, molestia liberemus. Ut enim mortis metu omnis quietae vitae status perturbatur, et ut succumbere doloribus eosque humili animo inbecilloque ferre miserum est, ob eamque causam propter voluptatem et dolorem. Ad haec et quae sequamur et quae sequamur et quae.","vendor":"West Corporation"},
{"contractType":"amc","cost":311,"expiryDate":"2025-05-09","id":"dc756502-9","serialNo":"08214c30-2d50-4","startDate":"2025-06-09","status":"Expired","terms":"Cum idem fabellas Latinas ad verbum e Graecis expressas non inviti legant. Quis enim tam inimicus paene nomini Romano est, qui alienae modum statuat industriae?","vendor":"Shell Midstream Partners, L.P."},
{"contractType":"cmc","cost":280,"expiryDate":"2024-07-27","id":"4fa4963f-8","serialNo":"9816a076-d793-4","startDate":"2025-01-02","status":"Cancelled","terms":"Summum esse bonum quicquam nisi nescio quam illam umbram, quod appellant honestum non tam id reprehendunt, si remissius agatur, sed tantum studium tamque multam operam ponendam in eo non arbitrantur. Erunt etiam, et ii quidem eruditi Graecis litteris, contemnentes.","vendor":"Southwestern Energy Company"},
{"contractType":"amc","cost":784,"expiryDate":"2024-12-21","id":"c83df22b-9","serialNo":"edcdbab5-f704-4","startDate":"2025-01-26","status":"Under Review","terms":"Reperietur. Nam neque laborum perfunctio neque perpessio dolorum per se ipsa esse contentam. Sed possunt haec quadam ratione dici non modo singulos homines, sed universas familias evertunt, totam etiam labefactant.","vendor":"Pier 1 Imports, Inc."},
{"contractType":"amc","cost":654,"expiryDate":"2024-08-26","id":"bc266eba-9","serialNo":"09220e9e-f75f-4","startDate":"2025-05-16","status":"Draft","terms":"Ob rem voluptas expetenda, fugiendus dolor sit. Sentiri haec putat.","vendor":"Pampa Energia S.A."},
{"contractType":"cmc","cost":756,"expiryDate":"2025-01-02","id":"0e9593b7-5","serialNo":"621e5fba-c5bc-4","startDate":"2025-05-22","status":"Active","terms":"Oratione solum, sed multo magis vita et factis et moribus comprobavit. Quod quam magnum.","vendor":"Hancock Holding Company"},
{"contractType":"cmc","cost":861,"expiryDate":"2025-03-07","id":"f970b230-7","serialNo":"b5a82757-b8e0-4","startDate":"2025-07-01","status":"Completed","terms":"Incurrunt, numquam vim tantam habent, ut non dicas, quid non probes. Principio, inquam, in physicis, quibus maxime gloriatur, primum totus est alienus. Democritea dicit perpauca mutans.","vendor":"PowerShares Russell 1000 Low Beta Equal Weight Portfolio"},
{"contractType":"amc","cost":828,"expiryDate":"2025-03-15","id":"19244796-5","serialNo":"d626d7f1-ce9a-4","startDate":"2024-11-20","status":"Renewed","terms":"Locus. Nunc autem explicabo, voluptas ipsa quae qualisque sit, ut tollatur error omnis imperitorum intellegaturque ea, quae sint coniuncta explicabo.","vendor":"Global Medical REIT Inc."},
{"contractType":"amc","cost":260,"expiryDate":"2025-05-11","id":"753a31f4-0","serialNo":"51217715-c032-4","startDate":"2024-07-19","status":"Pending","terms":"Ab ea nullo modo sine amicitia firmam et perpetuam iucunditatem vitae tenere possumus neque vero ipsam amicitiam tueri, nisi aeque amicos et nosmet ipsos diligamus, idcirco et hoc ipsum efficitur in amicitia.","vendor":"First Trust/Aberdeen Global Opportunity Income Fund"},
{"contractType":"cmc","cost":337,"expiryDate":"2024-12-29","id":"37a18efe-b","serialNo":"6da5c38f-0d98-4","startDate":"2024-08-10","status":"Terminated","terms":"Illa ipsa, ne simulent, et iis quidem non admodum indoctis, totum hoc displicet philosophari. Quidam autem non tam id reprehendunt, si remissius agatur, sed tantum studium.","vendor":"KCAP Financial, Inc."},
{"contractType":"cmc","cost":712,"expiryDate":"2025-01-12","id":"debc8256-5","serialNo":"ef9e0e12-c41e-4","startDate":"2024-10-27","status":"Active","terms":"Relinqueret? Non ergo Epicurus ineruditus, sed ii indocti, qui, quae pueros non didicisse turpe est, ea putant usque ad senectutem esse discenda. Quae cum dixisset, Explicavi, inquit, sententiam meam, et eo quidem consilio, tuum iudicium ut cognoscerem, quoniam mihi.","vendor":"Tabula Rasa HealthCare, Inc."},
{"contractType":"amc","cost":970,"expiryDate":"2024-09-23","id":"3e5d82e9-b","serialNo":"158df307-e0d9-4","startDate":"2025-01-23","status":"Pending","terms":"Quod sit a dolore corporis praesenti futurove seiunctum. Nec vero quisquam stultus non horum morborum aliquo laborat, nemo igitur est non miser. Accedit etiam mors, quae quasi.","vendor":"Peregrine Pharmaceuticals Inc."},
{"contractType":"cmc","cost":832,"expiryDate":"2024-11-17","id":"8be1b959-9","serialNo":"3398fa60-a481-4","startDate":"2025-05-18","status":"Suspended","terms":"Non possunt, conficiuntur et angore et metu maximeque cruciantur, cum sero sentiunt.","vendor":"CubeSmart"},
{"contractType":"amc","cost":851,"expiryDate":"2025-05-19","id":"a6ef727c-0","serialNo":"5950008f-57e7-4","startDate":"2025-04-10","status":"Expired","terms":"Sine ulla iniuria, quae autem tanta ex improbis factis ad minuendas vitae molestias accessio potest fieri, quanta ad augendas, cum conscientia factorum, tum poena legum odioque civium? Et tamen in quibusdam neque pecuniae modus est ullus investigandi veri, nisi inveneris, et quaerendi defatigatio turpis est, cum id, quod maxime placeat, facere possimus.","vendor":"Vident Core U.S. Bond Strategy Fund"},
{"contractType":"cmc","cost":459,"expiryDate":"2024-09-05","id":"05a854d1-7","serialNo":"85dfbbe2-d489-4","startDate":"2025-02-19","status":"Cancelled","terms":"Voluptate, quid eo miserius dici aut fingi potest? Quodsi vita doloribus referta maxime fugienda est, summum bonum consequamur? Clamat Epicurus, is quem vos nimis voluptatibus esse deditum dicitis; non posse reperiri. Quapropter.","vendor":"Cardiovascular Systems, Inc."},
{"contractType":"amc","cost":734,"expiryDate":"2024-11-01","id":"b760c938-3","serialNo":"6e34cbdb-fbc7-4","startDate":"2024-12-27","status":"Draft","terms":"Autem situm in nobis ut et adversa quasi perpetua oblivione obruamus et secunda iucunde ac suaviter meminerimus. Sed cum ea, quae dixi, sole ipso illustriora et clariora sunt, si omnia dixi hausta e fonte naturae, si tota oratio nostra omnem sibi fidem sensibus confirmat, id est eitam, ut ab ea nullo modo poterimus sensuum iudicia defendere.","vendor":"Vedanta  Limited"},
{"contractType":"amc","cost":839,"expiryDate":"2025-06-25","id":"da47f742-2","serialNo":"95d00f17-b9e5-4","startDate":"2024-08-02","status":"Completed","terms":"Omittam pericula, labores, dolorem etiam, quem optimus quisque pro patria et pro suis suscipit, ut non modo quid nobis probaretur, sed etiam cogitemus; infinitio ipsa, quam apeirian.","vendor":"First Trust International IPO ETF"},
{"contractType":"cmc","cost":935,"expiryDate":"2025-04-20","id":"34ecee51-a","serialNo":"e2bbb6c0-4d79-4","startDate":"2024-12-01","status":"Under Review","terms":"Graecum dici velit, ut a Scaevola est praetore salutatus Athenis Albucius. Quem quidem locum comit multa venustate et omni sale idem Lucilius, apud quem praeclare Scaevola: Graecum te, Albuci, quam Romanum atque Sabinum, municipem Ponti, Tritani, centurionum, praeclarorum hominum ac primorum signiferumque, maluisti dici. Graece ergo praetor Athenis, id quod maluisti, te, cum ad me de virtute misisti. Sed ex eo est consecutus? -- Laudem et caritatem, quae sunt vitae.","vendor":"Quinpario Acquisition Corp. 2"},
{"contractType":"cmc","cost":857,"expiryDate":"2025-03-21","id":"098f2125-7","serialNo":"00506428-6df1-4","startDate":"2025-05-07","status":"Renewed","terms":"Noster Lucilius, recusabo, quo minus omnes mea legant. Utinam esset ille Persius, Scipio vero et Rutilius multo etiam magis, quorum ille iudicium reformidans Tarentinis.","vendor":"European Equity Fund, Inc. (The)"},
{"contractType":"amc","cost":777,"expiryDate":"2024-07-17","id":"0a7a04d6-7","serialNo":"99e9114e-c07c-4","startDate":"2025-05-31","status":"Terminated","terms":"Voluptate, nihil scilicet novi, ea tamen, quae te ipsum probaturum esse confidam. Certe, inquam, pertinax non ero tibique, si mihi probabis.","vendor":"Lsb Industries Inc."},
{"contractType":"amc","cost":759,"expiryDate":"2024-08-24","id":"a8e82e1f-f","serialNo":"6d3d9e4f-e897-4","startDate":"2024-08-25","status":"Expired","terms":"Summa appareat, doctrina mediocris. Ego autem quem timeam lectorem, cum.","vendor":"Nature's Sunshine Products, Inc."},
{"contractType":"cmc","cost":135,"expiryDate":"2024-11-25","id":"6ce8baed-5","serialNo":"2c0b9ad8-5184-4","startDate":"2024-08-15","status":"Terminated","terms":"Eloquentiam, non asperner, si non habeat, non admodum flagitem. Re mihi non aeque satisfacit, et quidem locis pluribus. Sed quot homines, tot sententiae; falli igitur possumus. Quam ob rem tandem, inquit, non satisfacit? Te enim iudicem aequum puto, modo quae dicat ille bene noris. Nisi mihi Phaedrum, inquam, tu mentitum aut Zenonem putas, quorum utrumque.","vendor":"Associated Banc-Corp"},
{"contractType":"amc","cost":674,"expiryDate":"2025-03-28","id":"cf2db8e7-0","serialNo":"9f2039c2-2d50-4","startDate":"2025-04-17","status":"Suspended","terms":"Vitae tenere possumus neque vero ipsam amicitiam tueri, nisi aeque amicos et nosmet ipsos diligamus, idcirco.","vendor":"Sterling Bancorp"},
{"contractType":"cmc","cost":452,"expiryDate":"2025-02-15","id":"96894f93-e","serialNo":"c35b9b99-ebef-4","startDate":"2024-12-16","status":"Completed","terms":"Repellendus. Temporibus autem quibusdam et aut officiis debitis aut rerum necessitatibus saepe eveniet, ut et.","vendor":"Carnival Corporation"},
{"contractType":"amc","cost":437,"expiryDate":"2025-01-26","id":"42be8cf7-5","serialNo":"2dddbcb4-d63f-4","startDate":"2025-06-19","status":"Under Review","terms":"Quibus rebus intellegitur nec intemperantiam propter se expetendam esse dicemus, sed quia iucunditatis vel plurimum afferat. Nam diligi et carum esse iucundum est propterea, quia tutiorem vitam et voluptatem ipsam per se laetitiam, id est corpora individua propter soliditatem, censet.","vendor":"WGL Holdings Inc"},
{"contractType":"cmc","cost":535,"expiryDate":"2024-10-27","id":"352ecd8b-2","serialNo":"9dcda2c5-5cae-4","startDate":"2024-11-14","status":"Pending","terms":"-- aut ne deterruisset alios a studiis. Quamquam te.","vendor":"Magyar Bancorp, Inc."},
{"contractType":"amc","cost":126,"expiryDate":"2025-03-08","id":"29fdcbfc-9","serialNo":"f9c01f40-8bb9-4","startDate":"2025-04-23","status":"Cancelled","terms":"In qua maxime ceterorum philosophorum exultat oratio, reperire exitum potest, nisi derigatur ad voluptatem, voluptas autem est sola, quae nos a libidinum impetu et a spe pariendarum voluptatum seiungi non.","vendor":"Apollo Investment Corporation"},
{"contractType":"cmc","cost":282,"expiryDate":"2025-05-28","id":"741f8c24-a","serialNo":"60c9f9d3-de11-4","startDate":"2025-03-15","status":"Active","terms":"Aut arare aut aliquid ferre denique' -- non enim illum ab industria, sed ab inliberali labore deterret --, sic isti curiosi, quos offendit noster.","vendor":"The Obesity ETF"},
{"contractType":"cmc","cost":433,"expiryDate":"2024-12-21","id":"9600625b-b","serialNo":"1aba36c2-f731-4","startDate":"2024-09-30","status":"Renewed","terms":"Et refugiendi et omnino rerum gerendarum initia proficiscuntur aut a voluptate discedere. Nam cum ignoratione rerum bonarum et malarum maxime hominum vita vexetur, ob eumque errorem et voluptatibus maximis saepe priventur et durissimis animi doloribus torqueantur, sapientia est adhibenda, quae et splendide.","vendor":"Union Bankshares Corporation"},
{"contractType":"amc","cost":777,"expiryDate":"2025-06-23","id":"f85458f8-5","serialNo":"731f01a2-6e1e-4","startDate":"2025-06-09","status":"Draft","terms":"Putanda est, non expeteretur, si nihil tale metuamus. Iam illud quidem adduci vix possum, ut ea, quae praeterierunt, acri animo et attento intuemur, tum fit ut aegritudo sequatur, si illa mala sint, laetitia, si bona. O.","vendor":"Sportsman's Warehouse Holdings, Inc."}
]}